#include <bits/stdc++.h>
using namespace std;

void maxWater(int arr[], int n) {
    int ans = INT_MIN;
    int ai = -1, aj = -1;
    int i = 0, j = n - 1;

    while (i < j) {
        if (min(arr[i], arr[j]) > ans) {
            ans = min(arr[i], arr[j]);
            ai = i;
            aj = j;
        }

        if (arr[i] < arr[j]) {
            i++;
        } else {
            j--;
        }
    }

    cout << ai << " " << aj << endl;
}

int main() {
    int t;
    cin >> t;
    while (t--) {
        int n;
        cin >> n;
        int arr[n];
        for (int i = 0; i < n; i++) {
            cin >> arr[i];
        }
        maxWater(arr, n);
    }
    return 0;
}





// #include <bits/stdc++.h> // সম্পূর্ণ স্ট্যান্ডার্ড লাইব্রেরি ইমপোর্ট করুন
// using namespace std; // স্ট্যান্ডার্ড নামস্পেস ব্যবহার করুন

// void maxWater(int arr[], int n) { // সর্বোচ্চ পানি প্রদান করুন ফাংশন ডিফাইন করুন
//     int ans = INT_MIN; // এইখানে আনস হ'ল মিনিমাম সংখ্যা
//     int ai = -1, aj = -1; // এই ডিক্লেয়ার করা হয়েছে যেন তাদের সাথে যোগ করা যায়
//     int i = 0, j = n - 1; // একটি বেরিয়েবল সেট করুন, যেটি কাজ করবে আদেশ এর প্রারম্ভে এবং শেষে

//     while (i < j) { // যখন আই ছোট হয়ে যায় তখন
//         if (min(arr[i], arr[j]) > ans) { // যদি বর্তমান উচ্চতা সর্বোচ্চ হয়
//             ans = min(arr[i], arr[j]); // তাদের সংখ্যা হয়
//             ai = i; // প্রথম সংখ্যার ইনডেক্স হয়
//             aj = j; // দ্বিতীয় সংখ্যার ইনডেক্স হয়
//         }

//         if (arr[i] < arr[j]) { // যদি প্রথম সংখ্যা দ্বিতীয় সংখ্যায় বড়
//             i++; // তবে প্রথম সংখ্যাটি আরও একটি বেড়ে যান
//         } else {
//             j--; // অন্যথায়, দ্বিতীয় সংখ্যাটি আরও একটি কমান
//         }
//     }

//     cout << ai << " " << aj << endl; // উত্তর প্রিন্ট করুন
// }

// int main() { // মেইন ফাংশন
//     int t; // পরীক্ষার সংখ্যা
//     cin >> t; // ইনপুট নেওয়া হবে
//     while (t--) { // প্রতিটি পরীক্ষা কেসের জন্য
//         int n; // সংখ্যা গুলি
//         cin >> n; // ইনপুট নেওয়া হবে
//         int arr[n]; // সংখ্যাগুলির জন্য একটি অ্যারে ডিক্লেয়ার করুন
//         for (int i = 0; i < n; i++) { // প্রথম সংখ্যা দ্বারা শেষ সংখ্যা প্রদান করা হবে
//             cin >> arr[i]; // ইনপুট নেওয়া হবে
//         }
//         maxWater(arr, n); // ফাংশন কল করুন
//     }
//     return 0; // প্রোগ্রাম সফলভাবে সমাপ্ত হয়েছে
// }
